[
  {
    "timestamp": "2025-12-16 02:10:39",
    "sentence": "If I hadn't sprained my ankle, I wouldn't even spare him a glance. Sorry, I don't entertain non-work matters. 傅杭冷漠的声音从风中飘来，听着了无生趣，无比惆怅。 Fu Hang's cold voice drifted through the wind, sounding lifeless and deeply melancholy.",
    "source": "This sentence is likely from a Chinese novel or drama, possibly describing a scene where a character named Fu Hang speaks in a cold and detached manner, but the exact source is unknown.",
    "vocabulary": {
      "entertain": 1
    }
  },
  {
    "timestamp": "2025-12-16 11:34:22",
    "sentence": "The app's download numbers are off the charts this week.今天就到这里，分分钟数据报表就可以结算，直接下岗失业。 That's all for today. You can generate data reports in minutes. You'll be out of a job. 财务是一个非常讲究人的职业，想长久地做财务工作，一定要有深刻的职业认知，要维持自己的职业形象，这就是那个富豪刚聘用的保安，望着富豪离去的背影，小声地说道。 Finance is a profession that values interpersonal skills. If you want to stay in this field long-term, you need to have a deep understanding of it. You also need to maintain a professional image. This is the security guard that the rich man just hired. Looking at the rich man's back as he left, he whispered to his colleague. 你知道你为什么没有被调到一楼吗？ Do you know why you weren't transferred to the first floor? 那名保安目不斜视，抿着嘴小声回答。 The security guard stared straight ahead and answered in a low voice without turning his head. 为什么？ Why? 因为你小子没眼力见。 Because you lack professional insight.",
    "source": "This sentence appears to be a mix of English and Chinese fragments, possibly from a bilingual business or workplace scenario, though the exact source is unclear from the provided context.",
    "vocabulary": {
      "charts": 1
    }
  },
  {
    "timestamp": "2025-12-16 11:49:38",
    "sentence": "That guy just now looked shifty-eyed and sneaky. If Duan An hadn't caught him secretly, he would have rushed up just now. 所以认认真真要找那位的也行，他一个月回来两次，初一十五，同批了的。 So if you really want to find that person, he comes back twice a month, on the first and fifteenth day of the lunar month, like us. 认真叮嘱，这有钱人的嗜好还真是奇怪。 He seriously warned that the rich people's hobbies are really strange. 莫不是大名？ Could it be Daming? 保安下意识地摇头，看向位于三十六的云一号。 The security guard shook his head subconsciously, looking at Yunyi No.1 on the 36th floor. 不知道小刘为什么会被调过来。 I don't know why Xiao Liu was transferred here. 保安没理解这话的意思。 The security guard didn't understand what he meant.",
    "source": "This is a line from a Chinese novel or TV drama, possibly featuring a scene involving security guards and wealthy individuals in a high-rise building.",
    "vocabulary": {
      "shifty-eyed": 1
    }
  },
  {
    "timestamp": "2025-12-16 11:52:07",
    "sentence": "产业的能稳定年一亿。 The industry can generate a stable annual revenue of 100 million yuan. 不定的还有小起大笔。 There are also occasional large sums. 别闹，安心当舔狗好。 Stop joking. Just be a good sycophant. 每天固定打上班，其余时间真自由，财富自由。 Go to work at a fixed time every day, and enjoy true freedom and financial freedom for the rest of the time. 耗子，无非十几年婚生，这年头因为工作耽误事的还少吗？ Haozi, it's just a matter of getting married and having kids in a dozen years, aren't there enough examples of people delaying important matters due to work these days? 有事业心、有上进心、有理想、有抱负的新时代青年，是不是？ Ambitious, motivated, idealistic, and aspiring young people in the new era aren't they?",
    "source": "This appears to be a mix of business and motivational content, possibly from a Chinese social media post or a self-improvement video, but the exact source is not identifiable without more context.",
    "vocabulary": {
      "sycophant": 1
    }
  },
  {
    "timestamp": "2025-12-16 12:00:40",
    "sentence": "还急？等我们到你学校，你怕都没的办法。 Still in a hurry? By the time we get to your school, you'll be helpless. 另一名混混也开口。 Another hoodlum chimed in. 不，你们不能去学校，女孩猛的抬头，眼底惊恐更深。 No, you can't go to school. The girl looked up sharply, her eyes filled with even more fear. 是我告诉你们，要不是学生的身份能提高价格。 I told you, if it weren't for the students' identities, the price could be higher. 我们早去你学校。 We would have gone to your school already. 光头仰着头，一口浓烟，吐在了女孩的脸上， The bald guy puffed out a cloud of smoke, and blew the smoke in the girl's face.",
    "source": "This is likely from a Chinese novel or drama depicting a bullying scenario involving students and local hoodlums.",
    "vocabulary": {
      "hoodlum": 1,
      "chimed in": 1,
      "puffed out": 1
    }
  },
  {
    "timestamp": "2025-12-16 12:20:44",
    "sentence": "Are you looking for death? 另外一混混见了，立马转身靠了上来。 Another gangster immediately turned around and approached. 傅放一脸无辜，在人群外站着，目光依旧死死地盯着那个逼他到墙角的人。 Fu Fang looked innocent, standing outside the crowd, his eyes still fixed on the person who had cornered him. 对已经靠上来的混混浑然不知。 He was oblivious to the gangster who had already approached him. 洗到发白的衬衣，一个是某高中的运动裤，头发因为没洗变得非常散乱，厚厚的刘海盖住了整张脸，厚重的黑框眼镜更是遮盖住了双眼，但是一副职业舔狗的即视感。 He wore a faded shirt and sports pants from a high school, and his hair was unkempt due to not washing it, with thick bangs covering his entire face, and thick black-rimmed glasses hiding his eyes. He gave off the vibe of a professional simp.",
    "source": "This appears to be a line from a Chinese novel or web novel, possibly depicting a scene involving gangsters and a character named Fu Fang. The exact source is not identifiable as it does not reference a known published work or media.",
    "vocabulary": {
      "oblivious": 1,
      "bangs": 1
    }
  }
]